title=\u90c1\u95f7\u7684\u67b6\u6784\u5e08 (The Frustrated Architect)
slides=100
author=Simon Brown
date=11-Aug-2012
event=Architect Summit 2012
city=Shenzhen
country=China
pdf=true
video=
visible=true
summary=<p>\u5728\u8f6f\u4ef6\u6210\u529f\u4ea4\u4ed8\u7684\u8fc7\u7a0b\u4e2d\uff0c\u8f6f\u4ef6\u67b6\u6784\u5e08\u8d77\u7740\u63a7\u5236\u65b9\u5411\u7684\u4f5c\u7528\uff0c\u7136\u800c\u5f88\u591a\u56e2\u961f\u5374\u5ffd\u89c6\u4e86\u8fd9\u4e00\u70b9\uff0c\u8fd9\u5f88\u4ee4\u4eba\u90c1\u95f7\u3002\u4e0d\u7ba1\u662f\u4e00\u4e2a\u4eba\u627f\u62c5\uff0c\u8fd8\u662f\u56e2\u961f\u4e2d\u591a\u4e2a\u4eba\u5171\u4eab\uff0c\u4e0d\u7ba1\u662f\u5728\u654f\u6377\u5b9e\u65bd\u6700\u5f7b\u5e95\u7684\u56e2\u961f\u4e2d\uff0c\u8fd8\u662f\u8981\u505a\u5927\u91cf\u524d\u671f\u8bbe\u8ba1\u7684\u56e2\u961f\uff0c\u67b6\u6784\u5e08\u89d2\u8272\u603b\u662f\u4e0d\u53ef\u6216\u7f3a\uff0c\u800c\u4e14\u4ed6\u4eec\u7684\u6f14\u5316\u5f0f\u601d\u7ef4\u65b9\u5f0f\u5e38\u5e38\u80fd\u591f\u6fc0\u53d1\u7075\u611f\uff0c\u800c\u4e0d\u4ec5\u4ec5\u662f\u5bf9\u73b0\u5b9e\u7684\u5173\u7167\u3002\u771f\u6b63\u7684\u6210\u529f\uff0c\u5149\u9760\u5bf9\u65b0\u4e1c\u897f\u7684\u7740\u8ff7\u662f\u4e0d\u591f\u7684\uff0c\u8fd8\u9700\u8981\u5f00\u59cb\u63d0\u51fa\u5404\u79cd\u95ee\u9898\u3002\u654f\u6377\u9700\u8981\u67b6\u6784\u5e08\u4e48\uff1f\u67b6\u6784\u5e08\u53c8\u662f\u4e0d\u662f\u9700\u8981\u654f\u6377\uff1f\u8fd9\u51e0\u5e74\u6765\uff0c\u5bf9\u4e8e\u597d\u7684\u8f6f\u4ef6\u8bbe\u8ba1\uff0c\u6211\u4eec\u662f\u4e0d\u662f\u5fd8\u6389\u7684\u6bd4\u5b66\u5230\u7684\u8fd8\u8981\u8eb2\uff1f\u6d6e\u73b0\u5f0f\u8bbe\u8ba1\u771f\u7684\u5c31\u662f\u5750\u5728\u90a3\u91cc\u76fc\u7740\u6700\u597d\u7684\u4e8b\u60c5\u51fa\u73b0\u4e48\uff1f\u5982\u679c\u6211\u4eec\u660e\u5929\u771f\u7684\u4e0d\u518d\u57f9\u517b\u67b6\u6784\u5e08\u4e86\uff0c\u6211\u4eec\u8bf4\u7684\u8fd9\u4e9b\u53c8\u6709\u4f55\u610f\u4e49\uff1f\u6211\u4eec\u5982\u4f55\u4e0d\u518d\u90c1\u95f7\uff0c\u8d70\u5411\u5b81\u9759\uff1f</p>\
<p>The IT industry is either taking giant leaps ahead or it's in deep turmoil. On the one hand we're pushing forward, reinventing the way that we build software and striving for craftsmanship at every turn. On the other though, we're continually forgetting the good of the past and software teams are still failing on an alarmingly regular basis.</p>\
<p>Software architecture plays a pivotal role in the delivery of successful software yet it's frustratingly neglected by many teams. Whether performed by one person or shared amongst the team, the architecture role exists on even the most agile of teams yet the balance of up front and evolutionary thinking often reflects aspiration rather than reality.</p>\
<p>If we really do want to succeed, we need to get over our fascination with shiny new things and starting asking some questions. Does agile need architecture or does architecture actually need agile? Have we forgotten more about good software design than we've learnt in recent years? Does any of this matter if we're not fostering the software architects of tomorrow? How do we move from frustration to serenity?</p>